/* 
 Localizable.strings
 ARIS
 
 Created by David J Gagnon on 7/30/10.
 Copyright 2010 University of Wisconsin. All rights reserved.
 */

//General

"TakeYourPictureKey" = "[Take Your Public Player Image]";

"NoConnectionTitleKey" = "No connection to the Internet";
"NoConnectionMessageKey" = "Please connect to the internet and restart";
"NoLocationTitleKey" = "Location Service Error";
"NoLocationMessageKey" = "Please enable location services in iOS Settings-> General-> Location Services";
"PoorConnectionTitleKey" = "Network Warning";
"PoorConnectionMessageKey" = "Cannot communicate with the server.";
"BadServerResponseTitleKey" = "Bad Response From Server";
"BadServerResponseMessageKey" = "There was an error with the server or the server URL is not correct";
"LoginErrorTitleKey" = "Login Error";
"LoginErrorMessageKey" = "Unknown Username/Password";
"PreparingToPlayKey" = "Preparing to Play";
"TouchToPlayKey" = "Touch to Play";
"BackButtonKey" = "Back";
"LoadingKey" = "Loading...";
"OkKey" = "Ok";
"SaveKey" = "Save";
"NearbyObjectsTabKey" = "Nearby";
"NearbyObjectsTitleKey" = "Nearby Objects";
"SearchKey" = "Search";
"WaitingKey" = "Waiting...";
"ReviewsKey" = "Reviews";
"TapToContinueKey" = "Tap To Continue";
"OfKey" = "of";
"NoneKey" = "None";
"DontShareKey" = "Don't Share";
"BothKey" = "Both";
"CancelKey" = "Cancel";
"SharingKey" = "Sharing";
"DoneKey" = "Done";
"ErrorKey" = "Error";
"PleaseAddCommentKey" = "Please add a comment";
"UploadFailedKey" = "Upload Failed";
"IgnoreKey" = "Ignore";
"ReportKey" = "Report";
"EditKey" = "Edit";
"HideKeyboardKey" = "Hide Keyboard";
"SaveCommentKey" = "Save Comment";
"GoToKey" = "Go to";

//New Notification Keys
"LostNotifKey" = "Lost";
"TotalNotifKey" = "Total";
"LeftNotifKey" = "Left";
"ReceivedNotifKey" = "Received";
"CompletedNotifKey" = "Completed";

//AppModel
"AppModelItemReceivedKey" = "Item Received";
"AppModelItemLostKey" = "Item Lost";
"AppModelItemRemovedKey" = "removed";

//AppServices
"AppServicesReceivedOverlayListKey" = "Received Overlay List...";
"AppServicesReceivedQuestListKey" = "Received Quest List...";
"AppServicesReceivedLocationListKey" = "Received Location List...";
"AppServicesCachingGameMediaKey" = "Caching Game Media...";
"AppServicesStartingGameKey" = "Starting Game.";
"AppServicesReceivedGameItemListKey" = "Received Game Item List...";
"AppServicesReceivedGameNodeListKey" = "Received Game Node List...";
"AppServicesReceivedGameTabListKey" = "Received Game Tab List...";
"AppServicesReceivedGameNPCListKey" = "Received Game NPC List...";
"AppServicesReceivedGameWebpageListKey" = "Received Game Webpage List...";
"AppServicesReceivedGamePanoramicListKey" = "Received Game Panoramic List...";
"AppServicesReceivedInventoryKey" = "Received Inventory...";
"AppServicesUploadFailedMessageKey" = "A network error occured while uploading the file";

//Attributes View
//"AttributeReceivedKey" = "Attribute Received"; NOT USED
//"AttributeLostKey" = "Attribute Lost"; NOT USED OR TRANSLATED
"AttributesViewNameKey" = "Name";
"AttributesViewGroupKey" = "Group: N/A";
"AttributesAttributesTitleKey" = "Attributes";
"AttributesNoCurrentlyKey" = "No Attributes Currently Available";

//Audio Recorder
"AudioRecorderTitleKey" = "Recorder";
"BeginRecordingKey" = "Begin Recording Audio";
"StopRecordingKey" = "Stop Recording Audio";
"PlayKey" = "Play";
"StopKey" = "Stop";
"UploadKey" = "Upload";
"DiscardKey" = "Discard";
"NoAudioHardwareAvailableTitleKey" = "Warning";
"NoAudioHardwareAvailableMessageKey" = "Audio input hardware not available";

//AR View
"ARViewTitleKey" = "AR View";

//ARIS App Delegate
"ARISAppDelegateFectchingGameListsKey" = "Fetching Game Lists...";
"ARISAppDelegateWIFIErrorMessageKey" = "You may need to login to your Wifi connection from Safari. \nYou also may need to verify server settings in system preferences. \nIf the problem persists, please send us some debugging information.";

//Bogus Game
"BogusTitleKey" = "Leave Game";

//Camera
"CameraTitleKey" = "Camera";
"CameraLibraryButtonTitleKey" = "Use Library";
"CameraCameraButtonTitleKey" = "Use Camera";
"CameraImageTakenKey" = "Image Taken";
"CameraGameKey" = "Game";
"CameraPlayerKey" = "Player";

//Comments Form Cell
"CommentsFormNumberOfStarsRatingKey" = "Please give this game a rating of one through five stars";
"CommentsFormSuccessKey" = "Success!";
"CommentsFormSuccessMessageKey" = "Comment Successfully Posted";

//Comments View
"CommentsTitleKey" = "Comments";

//Developer View
"DeveloperTitleKey" = "Developer";
"DevelopersMetersKey" = "Meters";

//Dialog View
"DialogContinue" = "Tap to Continue";
"DialogReview" = "Tap to Review";
"DialogEnd" = "Leave Conversation";
"DialogPlayerName" = "You";

//Drop On Map View
"DropOnMapTitleKey" = "Place Note On Map";

//Forgot View
"ForgotEmailSentTitleKey" = "Email Sent";
"ForgotMessageKey" = "An email has been sent to you with instructions for changing your password";
"ForgotPasswordTitleKey" = "Invalid Email Address";
"ForgotPasswordMessageKey" = "Please enter the email address associated with your game account in order to recover your password.";

//Game Details View
"GameDetailsAuthorKey" = "Author(s)";
"DescriptionKey" = "Description";
"RatingKey" = "Rating";
"GameDetailsPlayNowKey" = "Play Now";
"GameDetailsResetKey" = "Reset";
"GameDetailsResetTitleKey" = "Are you sure?";
"GameDetailsResetMessageKey" = "Resetting will delete all game progress. Are you sure you want to do this?";
"GameDetailsResumeKey" = "Resume";
"GameDetailsNewGameKey" = "New Game";


//Game Picker
"GamePickerTitleKey" = "Leave Game";
"KilometersKey" = "Kilometers";
"PercentCompleteKey" = "% Complete";
"GamePickerNoNearbyGamesKey" = "No Nearby Games Found";
"GamePickerOtherGamesKey" = "Other Games";
"GameDetailsTitleKey" = "Details";
"PlayersKey" = "Players";
"AuthorsKey" = "Authors";
"DescriptionKey" = "Description";
"MapKey" = "Map";

//Game Picker Nearby
"GamePickerNoGamesKey" = "No Games Found";
"GamePickerMakeOneGameKey" = "You should make one at arisgames.org!";
"GamePickerNearbyGamesKey" = "Nearby Games";

//Game Picker Popular
"GamePickerPopularTitleKey" = "Popular";
"GamePickerPopularPlayedKey" = "Popular Games";

//Game Picker Recent
"GamePickerRecentTitleKey" = "Recent";
"GamePickeRecentPlayedKey" = "Recently Played Games";
"GamePickerRecentReviewsKey" = "reviews";

//Game Picker Search
"GamePickerSearchGamesKey" = "Search for Games";
"GamePickerSearchLoadingMoreKey" = "Loading more results...";
"GamePickerSearchNoMoreKey" = "No more results";
"GamePickerSearchNoResults" = "No results found";

//GPS View
"GPSViewQuickTravelKey" = "Quick Travel";

//Inventory View
"InventoryAddedToKey" = "added";
"InventoryNewItemKey" = "New Item";
"InventoryNewItemMessageKey" = "You have a new Item in your Inventory! Touch below to view your items now.";
"InventoryViewTitleKey" = "Inventory";
"WeightCapacityKey" = "Weight Capacity"; 
"QuantityKey" = "Quantity";
"WeightKey" = "Weight";

//Item Action View
"ItemActionCanCarryKey" = "Can only carry";
"ItemActionOfItemKey" = "of this item";
"ItemAcionCarryThatMuchKey" = "You can't carry that much. Only";
"PickedUpKey" = "picked up";
"ItemAcionCannotPickUpKey" = "This item cannot be picked up.";
"ItemAcionCannotCarryMoreKey" = "You cannot carry any more of this item.";
"ItemAcionTooHeavyKey" = "Too Heavy! Only";
"ItemAcionInventoryOverLimitKey" = "Inventory over Limit";

//Item Details View
"ItemDropKey" = "Drop";
"ItemDeleteKey" = "Destroy";
"ItemPickupKey" = "Pickup";
"ItemDetailKey" = "Detail";
"ItemDroppedTitleKey" = "Item Dropped";
"ItemDroppedMessageKey" = "Your Item was dropped here on the map for other players to see";
"ItemDestroyedTitleKey" = "Item Destroyed";
"ItemDestroyedMessageKey" = "This Item was removed from your inventory and permanently destroyed";
"ItemDuplicateTitleKey" = "Duplicate Item";
"ItemDuplicateMessageKey" = "You cannot carry any more of this item";
"ItemPickedUpTitleKey" = "Picked up an Item";
"ItemPickedUpMessageKey" = "It is available in your inventory";

//Inventory Trade View
"InventoryTradeViewTitleKey" = "Trade";
"InventoryTradeViewToTradeKey" = "Items to Trade";

//Login and
"LoginTitleKey" = "Login to Sifter";
"UsernameKey" = "Username";
"PasswordKey" = "Password";
"LoginKey" = "Login";
"NewAccountMessageKey" = "Don't Have an Account?";
"CreateAccountKey" = "Signup";
"SelfRegistrationTitleKey" = "Create a New User";
"SelfRegistrationMessageKey" = "Please enter ALL of the following";
"EmailKey" = "Email";
"FirstNameKey" = "First Name";
"LastNameKey" = "Last Name";
"CreateAccountKey" = "Create Account";

//Logout
"LogoutTitleKey" = "Logout";
"LogoutKey" = "Logout";
"LogoutWarningKey" = "Are you sure you wish to Logout?";

//Map View
"MapViewTitleKey" = "Map";
"MapTypeKey" = "Map Type";

//Notebook View
"NotebookTitleKey" = "Notebook";
"NotebookNoNotesKey" = "No Notes";
"NotebooksPressToAddKey" = "Press A Blue Button Above To Add One!";
"NotebookCommentsKey" = "comments";

//Note Comment View
"NoteCommentViewTitleKey" = "Comments";
"NoteCommentViewCreateFailedKey" = "Create Comment Failed";
"NoteCommentViewCreateFailedMessageKey" = "Cannot create a comment while offline";

//Note Editor View
"NoteEditorNoContentAddedKey" = "No Content Added";
"NoteEditorPressButtonsKey" = "Press Buttons Below To Add Some!";
"NodeEditorNewNoteKey" = "New Note";
"NoteEditorNotAllowedOneOrMoreMessageKey" = "This game doesn't allow one or more of these sharing options";
"NoteEditorNotAllowedKey" = "Not Allowed!";
"NoteEditorNotAllowedSharingToMapMessageKey" = "This game doesn't allow sharing to the map";
"NoteEditorListAndMapKey" = "List & Map";
"NoteEditorMapOnlyKey" = "Map Only";
"NoteEditorNotAllowedSharingToListsMessageKey" = "This game doesn't allow sharing to other people's lists";
"NoteEditorListOnlyKey" = "List Only";
"NoteEditorCreateNoteFailedKey" = "Create Note Failed";
"NoteEditorCreateNoteFailedMessageKey" = "Cannot create a note while offline";

//Overlay View
"OverLayViewPromptKey" = "Place a QR code inside the viewfinder rectangle to scan it.";

//Player Attributes
"PlayerTitleKey" = "Player";

//QR Scanner
"QRScannerTitleKey" = "Decoder";
"QRScannerErrorTitleKey" = "Scan Successful, But...";
"QRScannerErrorMessageKey" = "This code doesn't mean anything right now. You should come back later";
"QRScannerDecodingErrorTitleKey" = "Decoding Error";
"QRScannerDecodingKey" = "Decoding...";
"QRScannerDecodingErrorMessageKey" = "Try scanning the code again: Step back 2 feet and hold the camera as still as possible";
"ScanUsingCameraKey" = "Scan Using Camera";
"EnterCodeKey" = "Enter Code";

//Quests View
"QuestViewTitleKey" = "Quests";
"QuestsActiveTitleKey" = "Active Quests";
"QuestsCompleteTitleKey" = "Completed Quests";
"QuestViewNewQuestKey" = "New Quest";
"QuestViewNewQuestMessageKey" = "You have a new Quest! Touch here to see the current and completed quests.";
"QuestsComplete" = "Quests Complete";
"QuestsViewNewQuestsKey" = "New Quest Available";
"QuestsViewQuestCompletedKey" = "Quest Completed";

//Self Registration
"SelfRegistrationErrorMessageKey" = "Either this name has been taken or you didn't fill out all the required information.";
"SelfRegistrationSuccessMessageKey" = "Your new User was Created. Please login.";

//Start Over
"StartOverTitleKey" = "Start Over";
"StartOverKey" = "Start Over";
"StartOverWarningKey" = "This cannot be reversed";
"StartOverResetAlertTitleKey" = "Success";
"StartOverResetAlertMessageKey" = "You have reset your progress for this game";

//Tag View
"TagViewCannotCreateKey" = "Cannot Create New Tag";
"TagViewNoPlayerCreatedTagsKey" = "This game does not allow the use of player created tags!";
"TagViewNoGameTagsKey" = "No Game Tags";
"TagViewNoTagsCreatedKey" = "No tags were created for this game";
"TagViewNoTagsKey" = "No Tags";
"TagViewNotCreatedKey" = "You haven't created any tags";
"TagViewCreateNewTagKey" = "Create a New Tag";

//Text View
"TextViewTitleKey" = "Add Text";

//Title and Description Form
"TitleAndDescriptionTitleKey" = "Title";
"TitleAndDescriptionTitlePrompt" = "Enter a Title";
"TitleAndDescriptionDescriptionPrompt" = "Enter a Description";

//Upload Man
"UploadManDelayedKey" = "Upload Delayed";
"UploadManDelayedMessageKey" = "This item is over 500Kb. You should connect to a Wifi network to resume the upload.";
"UploadManRetryUploadTitleKey" = "Retry Upload?";
"UploadManRetryUploadTextKey" = "There is some user content that was not successfully uploaded. Would you like to retry uploading it now?";

